#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_role.deployment: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0c352107e629e3334]
aws_dynamodb_table.terraform_state_lock: Refreshing state... [id=terraform-state]
aws_s3_bucket.terraform_state: Refreshing state... [id=mati-terraform-state]
data.aws_iam_role.deployment: Read complete after 0s [id=deployment-role]
aws_s3_bucket_policy.terraform_state: Refreshing state... [id=mati-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=mati-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_organization.org will be created
  + resource "aws_organizations_organization" "org" {
      + accounts             = (known after apply)
      + arn                  = (known after apply)
      + feature_set          = "ALL"
      + id                   = (known after apply)
      + master_account_arn   = (known after apply)
      + master_account_email = (known after apply)
      + master_account_id    = (known after apply)
      + master_account_name  = (known after apply)
      + non_master_accounts  = (known after apply)
      + roots                = (known after apply)
    }

  # aws_organizations_organizational_unit.preprod will be created
  + resource "aws_organizations_organizational_unit" "preprod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "preprod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.prod will be created
  + resource "aws_organizations_organizational_unit" "prod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "production"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_vpc.main2 will be created
  + resource "aws_vpc" "main2" {
      + arn                                  = (known after apply)
      + cidr_block                           = "11.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @alexmxti, Working Directory: `aws-account-management`*